[Play_X2_XP_S_SPK_Generic_Failure_A AkEvent]
SpokenText="And so the Elders bless us with yet another victory. We are humbled, taking one more step towards the glorious future they promise us all."

[Play_X2_XP_S_SPK_Generic_Failure_B AkEvent]
SpokenText="Again our brave soldiers hold the forces of chaos at bay. We push back against the darkness with the light of the Elders. We cannot fail!"

[Play_X2_XP_S_SPK_Generic_Failure_C AkEvent]
SpokenText="Our enemy would have you forget the injustices of the old world. Forget the violence. The suffering. The needless death. But we of ADVENT do not forget. We remember. We ensure that it will never happen again. We prevail."

[Play_X2_XP_S_SPK_Generic_Failure_D AkEvent]
SpokenText="Harden your heart against those who would harm the union between humanity and the Elders. They are no longer your brothers and sisters. The rejected us all the moment they stood against the Elders."

[Play_X2_XP_S_SPK_Generic_Failure_E AkEvent]
SpokenText="The true power of ADVENT is unleashed upon our enemy and they crumble. We do not hide in the shadows, we bask in the Elders' light."

[Play_X2_XP_S_SPK_Generic_Success_A AkEvent]
SpokenText="I would like to assure the citizens of ADVENT that our peacekeepers will stop at nothing to prevent further attacks by criminal elements such as the one that occurred today. The Elders have total faith in our ability to overcome any and all threats to our peace."

[Play_X2_XP_S_SPK_Generic_Success_B AkEvent]
SpokenText="We must never allow these dissidents to fill our hearts with fear. Their victory today is a minor footnote in history. A small bump on the path of salvation the Elders have set forth for us."

[Play_X2_XP_S_SPK_Generic_Success_C AkEvent]
SpokenText="Twenty years of peace and prosperity will not be undone by the reckless actions of a few misguided dissidents today. We stand with the Elders. Trust in their wisdom and we shall overcome this crisis."

[Play_X2_XP_S_SPK_Generic_Success_D AkEvent]
SpokenText="And despite the destruction left in their wake, XCOM refuses to let go of the ways of the old world. They will continue their wanton and reckless crimes until the entire world burns around them. We are grateful to the Elders for their support in ending this menace once and for all."

[Play_X2_XP_S_SPK_Generic_Success_E AkEvent]
SpokenText="Even now our enemy lurks in the shadows. Plotting to destroy all we have built. To return us to the chaos of the Old World. Only together can we oppose them. United in the Elders' love for us we shall prevail. No matter the cost."

[Play_X2_XP_S_SPK_Neutralize_Failure_A AkEvent]
SpokenText="And so it is with great pleasure that I report a recent attack by dissident forces on an innocent civilian was easily repelled by our brave peacekeepers. Once again our loyal forces secure the safety and security of our union!"

[Play_X2_XP_S_SPK_Neutralize_Failure_B AkEvent]
SpokenText="Dissident forces again attempted to take the life of a loyal citizens today. Were it not for the intrepid forces of the ADVENT peacekeepers they might have succeeded. We must thank the Elders for their continued protection."

[Play_X2_XP_S_SPK_Neutralize_Failure_C AkEvent]
SpokenText="The Elders value each and every member of our Coalition. Today they again prove their vow to protect humanity, their Peacekeeping forces having repelled yet another threat from XCOM."

[Play_X2_XP_S_SPK_Neutralize_Failure_D AkEvent]
SpokenText="Today's battle with XCOM dissidents ended in their bloody defeat. We do not applaud; rather, we mourn the loss of life. If only they could understand the glory of the Elders. If only they could embrace unity."

[Play_X2_XP_S_SPK_Neutralize_Failure_E AkEvent]
SpokenText="Again XCOM attempts to sow fear in the people, targeting a civilian worker for their latest attack. Yet their viscous assault was once again repelled by our ever vigilant forces. Our enemy retreats to the wild lands like the wounded animals they are."

[Play_X2_XP_S_SPK_Neutralize_Success_A AkEvent]
SpokenText="Fellow citizens, it is with deep regret that I must inform you that the criminals among us who would dare see our union fail have sunken so low as to attack a peaceful civilian under the employ of ADVENT. Remain vigilant and rest assured we will stop at nothing to prevent these grievous attacks!"

[Play_X2_XP_S_SPK_Neutralize_Success_B AkEvent]
SpokenText="Do not fear the dissident elements who strike against your fellow citizens. Pity them, but show no fear. For theirs is but the reaction of a dying animal who knows their end is upon them. ADVENT is eternal. They are not."

[Play_X2_XP_S_SPK_Neutralize_Success_C AkEvent]
SpokenText="Another loyal citizen was taken from us this day by these radical elements who would poison our world's future. And still, the Elders offer their hand in friendship. This burden they bear for the sake of all humanity."

[Play_X2_XP_S_SPK_Neutralize_Success_D AkEvent]
SpokenText="Vicious criminals inflicted a sudden and unprovoked assault upon us today. May our thoughts be with the ADVENT citizens we lost, may they truly be at peace forever in the Elders' loving embrace."

[Play_X2_XP_S_SPK_Neutralize_Success_E AkEvent]
SpokenText="How often have we counseled you, our loyal citizens, to harbor no sympathy for the dissident factions that hide within our walls. For in the end they shall always betray you. Such was the fatal lesson learned today by one prominent ADVENT citizen. A tragic loss for us all."

[Play_X2_XP_S_SPK_Rescue_Failure_A AkEvent]
SpokenText="Yet again, these fringe radicals attempt to disrupt the great work of our rehabilitation centers. We thank our valiant Peacekeepers for ensuring their safety, that more citizens can free themselves from the shackles of the old world and embrace the glory of the Elders."

[Play_X2_XP_S_SPK_Rescue_Failure_B AkEvent]
SpokenText="The compassion of the Elders' guides our responses to all things. After today's timely intervention by our peacekeepers, ADVENT welcomes another errant citizen back into the fold."

[Play_X2_XP_S_SPK_Rescue_Failure_C AkEvent]
SpokenText="Each wayward being that we bring back to the light of the Elders takes us one step closer to true unity and salvation. Our rehabilitation centers are our temples to the Elders. Our enemy will think twice before they defile them again."

[Play_X2_XP_S_SPK_Rescue_Failure_D AkEvent]
SpokenText="There is no price too high to pay to ensure the safety of the troubled individuals seeking guidance in our rehabilitation centers. Today XCOM learned this firsthand. A brutal but necessary lesson."

[Play_X2_XP_S_SPK_Rescue_Failure_E AkEvent]
SpokenText="ADVENT welcomes these assaults on our detention facilities. As they did today, our peacekeepers are more than happy to introduce these dissidents to a holding cell."

[Play_X2_XP_S_SPK_Rescue_Success_A AkEvent]
SpokenText="Again, I urge all citizens to remain calm. Though XCOM radicals did manage to release a handful of detainees from our detention centers, there is no cause for alarm. For your protection, security patrols have been doubled and curfew extended. Rest assured, they will be found."

[Play_X2_XP_S_SPK_Rescue_Success_B AkEvent]
SpokenText="I join you in your concern for the poor individuals snatched from our rehabilitation center today. Their new lives were beginning, their hearts opening to the embrace of the Elders. I assure you, we will get them back."

[Play_X2_XP_S_SPK_Rescue_Success_C AkEvent]
SpokenText="Would that there were no need for our detention centers. That all of us could share the Elder's love. Yet by releasing detainees today XCOM again proves the need for such facilities' existence. We must remain strong."

[Play_X2_XP_S_SPK_Rescue_Success_D AkEvent]
SpokenText="And so I ask you loyal citizens to memorize the faces of the vile criminals freed by XCOM. Report them immediately upon sight. You are the eyes of ADVENT. You are the will of the Elders. Together we shall prevail!"

[Play_X2_XP_S_SPK_Rescue_Success_E AkEvent]
SpokenText="These dissidents cannot defeat our noble union. Today's fugitive abduction from an ADVENT detention center is a sign of desperation, for only true deviants could ever join XCOM's corrupt cause."

[Play_X2_XP_S_SPK_Retaliation_Failure_A AkEvent]
SpokenText="ADVENT Peacekeeping forces continue their message of hope and peace in the outlying territories. Though another settlement embraces the message of the Elders there is still much more work to be done. There is an entire world to be saved."

[Play_X2_XP_S_SPK_Retaliation_Failure_B AkEvent]
SpokenText="We cannot and will not permit these violent criminals to congregate in the outlying settlements! Though we abhor any loss of life we must press forward, those who threaten the principles of our great union can no longer be tolerated."

[Play_X2_XP_S_SPK_Retaliation_Failure_C AkEvent]
SpokenText="Our heroic ADVENT forces return home from the badlands, their mission a success. And our world moves ever closer to lasting peace."

[Play_X2_XP_S_SPK_Retaliation_Failure_D AkEvent]
SpokenText="Tonight we can sleep soundly, for our valiant ADVENT peacekeepers return home, having secured the wild lands outside our walls yet again. We are grateful to the Elders for their protection which they provide us time and again."

[Play_X2_XP_S_SPK_Retaliation_Failure_E AkEvent]
SpokenText="When allowed to gather, the flawed rhetoric of these dissidents can fester like an open wound. But just as our Gene Therapy clinics purge illness from our bodies, so must our ADVENT forces cleanse these dissident camps from our world."

[Play_X2_XP_S_SPK_Retaliation_Success_A AkEvent]
SpokenText="Citizens of ADVENT, despite the best efforts of our noble peacekeepers, their work today to wipe clean a refuge belonging to criminal elements outside the city were thwarted by the barbaric group XCOM. Know that we will not be deterred by their ongoing campaign against peace."

[Play_X2_XP_S_SPK_Retaliation_Success_B AkEvent]
SpokenText="Loyal citizens, I come to you with a heavy heart. ADVENT outreach forces were ambushed earlier today while spreading their message of unity and hope to the outer settlements. We shall mourn their loss. And avenge their sacrifice."

[Play_X2_XP_S_SPK_Retaliation_Success_C AkEvent]
SpokenText="Though our Peacekeeping forces were ambushed today by radical elements, their work must continue. We will not rest until the wild lands beyond our borders are tamed. Until our world and our people are safe."

[Play_X2_XP_S_SPK_Retaliation_Success_D AkEvent]
SpokenText="We must never doubt the depths to which our enemy will sink in their misguided beliefs. Today's cruel ambush of ADVENT outreach squads again proves that we can no longer tolerate XCOM's commitment to the violence and cruelty of the old world."

[Play_X2_XP_S_SPK_Retaliation_Success_E AkEvent]
SpokenText="Again XCOM stands against progress. Again they assault our peacekeeping forces in the outer territories. And again they would see the chaos and brutality of their decayed world thrust upon us. But we must remain steadfast. We must remain absolute in our purpose. For we are ADVENT."

[Play_X2_XP_S_SPK_Sabotage_Failure_A AkEvent]
SpokenText="Only the commitment of ADVENT forces prevented today's senseless attack on our infrastructure. Rest assured our forces will press forward with righteous fury until XCOM and their rebellious allies have been defeated once and for all."

[Play_X2_XP_S_SPK_Sabotage_Failure_B AkEvent]
SpokenText="XCOM and their so-called resistance allies again attempt to disrupt basic ADVENT social and medical services. And once again our brave Peacekeepers risk their own lives to ensure the safety and comfort of all our citizens. That is the beauty of ADVENT. That is the power of unity."

[Play_X2_XP_S_SPK_Sabotage_Failure_C AkEvent]
SpokenText="ADVENT has no tolerance for attacks on our infrastructure. Such cowardly strikes must be stopped with unrelenting force, as our peacekeepers did earlier today. We will never gamble with the lives of our fellow citizens."

[Play_X2_XP_S_SPK_Sabotage_Failure_D AkEvent]
SpokenText="XCOM's campaign of chaos and confusion was dealt another major blow today by our valiant forces. ADVENT Peacekeepers responded quickly and efficiently to an unwarranted assault on a major communications hub. Have no fear, the message of the Elders will continue to enlighten this world."

[Play_X2_XP_S_SPK_Sabotage_Failure_E AkEvent]
SpokenText="A recent failed attempt by XCOM criminals to siphon vital ADVENT resources reveals the futility of their cause. Why do they rely upon the wonders of the new world when they advocate for a return to the old."

[Play_X2_XP_S_SPK_Sabotage_Success_A AkEvent]
SpokenText="Again the unwarranted attacks of the so-called resistance organizations that plague our world, have severely damaged critical ADVENT infrastructure, delaying the delivery of valuable food and medicine to the outlying city centers. We ask the Elders to watch over those who will now end up in need."

[Play_X2_XP_S_SPK_Sabotage_Success_B AkEvent]
SpokenText="ADVENT city centers are but one organism. When criminals such as XCOM strike against any single part, they strike at us all. While ADVENT outreach squads rush to provide much needed assistance to the affected areas, our peacekeepers hunt down our attackers to ensure that such tragedy never occurs again."

[Play_X2_XP_S_SPK_Sabotage_Success_C AkEvent]
SpokenText="Today's senseless attack by the dissident forces of XCOM creates nothing but misery for our loyal citizens. The so-called resistance lashes out, attempting to sow discord and tragedy in their wake. But we shall not falter. ADVENT shall prevail."

[Play_X2_XP_S_SPK_Sabotage_Success_D AkEvent]
SpokenText="For years these radicals have threatened the union between humanity and the Elders. Today, with the destruction of vital infrastructure, they would now threaten our very way of life. We must follow the example of the Elders and show patience while essential services are restored."

[Play_X2_XP_S_SPK_Sabotage_Success_E AkEvent]
SpokenText="Like jealous children these radicals seek to strip us of the wondrous gifts provided by the Elders. Though we might pity their ignorance we will not allow such incursions to remain unchallenged. Today's setback is the prelude for tomorrow's victory!"

[Play_X2_XP_S_SPK_Swarm_Failure_A AkEvent]
SpokenText="For too long have we suffered the threat of XCOM. Today they experienced the full might of ADVENT. It is a lesson they will not soon forget."

[Play_X2_XP_S_SPK_Swarm_Failure_B AkEvent]
SpokenText="For where can our enemy can hope to hide from us? We are ADVENT. Our reach has no bounds. Today our grip tightens around our enemy. There is no escape."

[Play_X2_XP_S_SPK_Swarm_Failure_C AkEvent]
SpokenText="As the Elders will it, the full wrath of ADVENT swarms upon our enemy. They can no longer hide in the shadows. The light of the Elders is upon them."

[Play_X2_XP_S_SPK_Swarm_Failure_D AkEvent]
SpokenText="No longer will XCOM continue to propagate the lies and mistakes of the Old World. With the success of today's assault, we ensure a glorious future for all mankind."

[Play_X2_XP_S_SPK_Swarm_Failure_E AkEvent]
SpokenText="ADVENT does not revel in violence nor death as our enemies do. We take no pleasure from today's victory, except for the knowledge that it brings this world one step closer towards true unification and peace."

[Play_X2_XP_S_SPK_Swarm_Success_A AkEvent]
SpokenText="Fellow citizens, I come to you with unfortunate news. Yet another deadly assault by the murderous forces of the so-called resistance has been committed against us. A great number of ADVENT peacekeepers have given their lives today. I ask that you keep them in your thoughts, as they return to the Elders."

[Play_X2_XP_S_SPK_Swarm_Success_B AkEvent]
SpokenText="While XCOM's treacherous tactics have resulted in the deaths of many loyal peacekeepers know that their sacrifice will not be in vain. For our reach is vast. And we strike with the righteous fury of the Elders. They will not let the death of a single loyal citizen go unchallenged!"

[Play_X2_XP_S_SPK_Swarm_Success_C AkEvent]
SpokenText="And so now I ask you to take a moment to remembered the brave ADVENT peacekeepers who gave their lives today for us. Their constant sacrifice is what keeps the tide of chaos and corruption of the old world at bay. May the Elder's blessings be upon them forever."

[Play_X2_XP_S_SPK_Swarm_Success_D AkEvent]
SpokenText="Not once have the Elders abandoned their accord with humanity, even as these contemptuous dissidents assault their most loyal of forces, We must be thankful for their patience with us. And we must never stop the fight against those who would see our union falter."

[Play_X2_XP_S_SPK_Swarm_Success_E AkEvent]
SpokenText="Another violent confrontation befell our brave ADVENT forces today. Our selfless peacekeepers gave their lives to protect our fellow citizens from dissident XCOM forces."

